Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.2.39/edc/ATSAML22N17A.PIC
      <edc:SFRDef edc:_addr="0x4000003C" edc:access="-------------rrrrrrrrrrrrrrrrrrr" edc:cname="STATUSC" edc:impl="0x7FFFF" edc:mclr="00000000000010000000000000000000" edc:nzwidth="0x20" edc:por="00000000000010000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:desc="EVSYS APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:desc="SERCOM0 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:desc="SERCOM1 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:desc="SERCOM2 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM3_" edc:desc="SERCOM3 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM4_" edc:desc="SERCOM4 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM5_" edc:desc="SERCOM5 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC0_" edc:desc="TCC0 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:desc="TC0 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:desc="TC1 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:desc="TC2 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC3_" edc:desc="TC3 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC_" edc:desc="ADC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:desc="AC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:desc="PTC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLCD_" edc:desc="SLCD APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AES_" edc:desc="AES APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:desc="TRNG APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:desc="CCL APB Protect Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000040" edc:offset="0x3C0"/>
      <edc:SFRDef edc:_addr="0x40000400" edc:access="-----n--" edc:cname="CTRLA" edc:impl="0x4" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="IORET" edc:desc="I/O Retention" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000401" edc:access="-----nnn" edc:cname="SLEEPCFG" edc:impl="0x7" edc:mclr="00000010" edc:nzwidth="0x8" edc:por="00000010" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="SLEEPMODE" edc:desc="Sleep Mode" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="CPU, AHBx, and APBx clocks are OFF" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="STANDBY" edc:desc="All Clocks are OFF" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="BACKUP" edc:desc="Only Backup domain is powered ON" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="All power domains are powered OFF" edc:when="(field &amp; 0x7) == 6"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000402" edc:access="n-----nn" edc:cname="PLCFG" edc:impl="0x83" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="PLSEL" edc:desc="Performance Level Select" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="PL0" edc:desc="Performance Level 0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PL1" edc:desc="Performance Level 1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PL2" edc:desc="Performance Level 2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PLDIS" edc:desc="Performance Level Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000403" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x40000404" edc:access="-------n" edc:cname="INTENCLR" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="PLRDY" edc:desc="Performance Level Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000405" edc:access="-------n" edc:cname="INTENSET" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="PLRDY" edc:desc="Performance Level Ready interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000406" edc:access="-------n" edc:cname="INTFLAG" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="PLRDY" edc:desc="Performance Level Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000407" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x40000408" edc:access="----nn--nn------" edc:cname="STDBYCFG" edc:impl="0xCC0" edc:mclr="0000010000000000" edc:nzwidth="0x10" edc:por="0000010000000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="VREGSMOD" edc:desc="Voltage Regulator Standby mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="AUTO" edc:desc="Automatic mode" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PERFORMANCE" edc:desc="Performance oriented" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="LP" edc:desc="Low Power oriented" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BBIASHS" edc:desc="Back Bias for HMCRAMCHS" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="RETBB" edc:desc="Retention Back Biasing mode" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="STDBYBB" edc:desc="Standby Back Biasing mode" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="STDBYOFF" edc:desc="Standby OFF mode" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Always OFF mode" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000040A" edc:offset="0x3F7"/>
      <edc:SFRDef edc:_addr="0x40000801" edc:access="-------n" edc:cname="INTENCLR" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="CKRDY" edc:desc="Clock Ready Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000802" edc:access="-------n" edc:cname="INTENSET" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="CKRDY" edc:desc="Clock Ready Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000803" edc:access="-------n" edc:cname="INTFLAG" edc:impl="0x1" edc:mclr="00000001" edc:nzwidth="0x8" edc:por="00000001" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="CKRDY" edc:desc="Clock Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000804" edc:access="nnnnnnnn" edc:cname="CPUDIV" edc:mclr="00000001" edc:nzwidth="0x8" edc:por="00000001" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="CPUDIV" edc:desc="CPU Clock Division Factor" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide by 1" edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide by 4" edc:when="(field &amp; 0xFF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide by 8" edc:when="(field &amp; 0xFF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16" edc:when="(field &amp; 0xFF) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Divide by 32" edc:when="(field &amp; 0xFF) == 0x20"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide by 64" edc:when="(field &amp; 0xFF) == 0x40"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide by 128" edc:when="(field &amp; 0xFF) == 0x80"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000805" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x40000806" edc:access="nnnnnnnn" edc:cname="BUPDIV" edc:mclr="00000001" edc:nzwidth="0x8" edc:por="00000001" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="BUPDIV" edc:desc="Backup Clock Division Factor" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide by 1" edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide by 4" edc:when="(field &amp; 0xFF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide by 8" edc:when="(field &amp; 0xFF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16" edc:when="(field &amp; 0xFF) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Divide by 32" edc:when="(field &amp; 0xFF) == 0x20"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide by 64" edc:when="(field &amp; 0xFF) == 0x40"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide by 128" edc:when="(field &amp; 0xFF) == 0x80"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000807" edc:offset="0x9"/>
      <edc:SFRDef edc:_addr="0x40000810" edc:access="---------------------nnnn-nnnnnn" edc:cname="AHBMASK" edc:impl="0x7BF" edc:mclr="00000000000000000000011111111111" edc:nzwidth="0x20" edc:por="00000000000000000000011111111111" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="HPB0_" edc:desc="HPB0 AHB Clock Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPB1_" edc:desc="HPB1 AHB Clock Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPB2_" edc:desc="HPB2 AHB Clock Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:desc="DMAC AHB Clock Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USB_" edc:desc="USB AHB Clock Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:desc="DSU AHB Clock Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PAC_" edc:desc="PAC AHB Clock Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:desc="NVMCTRL AHB Clock Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSRAM_" edc:desc="HSRAM AHB Clock Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_PICACHU_" edc:desc="NVMCTRL_PICACHU AHB Clock Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000814" edc:access="--------------------nnnnnnnnnnnn" edc:cname="APBAMASK" edc:impl="0xFFF" edc:mclr="00000000000000000001111111111111" edc:nzwidth="0x20" edc:por="00000000000000000001111111111111" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="PAC_" edc:desc="PAC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:desc="PM APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:desc="MCLK APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:desc="RSTC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:desc="OSCCTRL APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:desc="OSC32KCTRL APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:desc="SUPC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:desc="GCLK APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:desc="WDT APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:desc="RTC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:desc="EIC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:desc="FREQM APB Clock Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
