Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.2.39/edc/ATSAML22N17A.PIC
      <edc:SFRDef edc:_addr="0x40001013" edc:access="-------n" edc:cname="EVCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="CFDEO" edc:desc="Clock Failure Detector Event Output Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001014" edc:access="nn--nnn-" edc:cname="OSC16MCTRL" edc:impl="0xCE" edc:mclr="10000010" edc:nzwidth="0x8" edc:por="10000010" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Oscillator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL" edc:desc="Oscillator Frequency Select" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="4" edc:desc="4MHz" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8MHz" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="12" edc:desc="12MHz" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16MHz" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Control" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001015" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40001018" edc:access="----nnnnnnnnnnn-" edc:cname="DFLLCTRL" edc:impl="0xFFE" edc:mclr="0000000010000000" edc:nzwidth="0x10" edc:por="0000000010000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="DFLL Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Operating Mode Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STABLE" edc:desc="Stable DFLL Frequency" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LLAW" edc:desc="Lose Lock After Wake" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBCRM" edc:desc="USB Clock Recovery Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCDIS" edc:desc="Chill Cycle Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QLDIS" edc:desc="Quick Lock Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BPLCKC" edc:desc="Bypass Coarse Lock" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAITLOCK" edc:desc="Wait Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000101A" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x4000101C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DFLLVAL" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="FINE" edc:desc="Fine Value" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="COARSE" edc:desc="Coarse Value" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="DIFF" edc:desc="Multiplication Ratio Difference" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001020" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DFLLMUL" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="MUL" edc:desc="DFLL Multiply Factor" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="FSTEP" edc:desc="Fine Maximum Step" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CSTEP" edc:desc="Coarse Maximum Step" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001024" edc:access="n-------" edc:cname="DFLLSYNC" edc:impl="0x80" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="READREQ" edc:desc="Read Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001025" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40001028" edc:access="nn----n-" edc:cname="DPLLCTRLA" edc:impl="0xC2" edc:mclr="10000000" edc:nzwidth="0x8" edc:por="10000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001029" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x4000102C" edc:access="------------nnnn----nnnnnnnnnnnn" edc:cname="DPLLRATIO" edc:impl="0xF0FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="LDR" edc:desc="Loop Divider Ratio" edc:nzwidth="0xC"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LDRFRAC" edc:desc="Loop Divider Ratio Fractional Part" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001030" edc:access="-----nnnnnnnnnnn---n-nnn--nnnnnn" edc:cname="DPLLCTRLB" edc:impl="0x7FF173F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="FILTER" edc:desc="Proportional Integral Filter Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Default filter mode" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LBFILT" edc:desc="Low bandwidth filter" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="HBFILT" edc:desc="High bandwidth filter" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HDFILT" edc:desc="High damping filter" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPEN" edc:desc="Low-Power Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WUF" edc:desc="Wake Up Fast" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFCLK" edc:desc="Reference Clock Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="XOSC32K clock reference" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="XOSC" edc:desc="XOSC clock reference" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="GCLK clock reference" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LTIME" edc:desc="Lock Time" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="No time-out. Automatic lock." edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="8MS" edc:desc="Time-out if no lock within 8ms" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="9MS" edc:desc="Time-out if no lock within 9ms" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="10MS" edc:desc="Time-out if no lock within 10ms" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="11MS" edc:desc="Time-out if no lock within 11ms" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LBYPASS" edc:desc="Lock Bypass" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:desc="Clock Divider" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
