Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.2.39/edc/ATSAML22N17A.PIC
      <edc:SFRDef edc:_addr="0x410060B0" edc:access="nnnnnnnn" edc:cname="GROUP1PMUX0" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410060B1" edc:access="nnnnnnnn" edc:cname="GROUP1PMUX1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410060B2" edc:access="nnnnnnnn" edc:cname="GROUP1PMUX2" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410060B3" edc:access="nnnnnnnn" edc:cname="GROUP1PMUX3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410060B4" edc:access="nnnnnnnn" edc:cname="GROUP1PMUX4" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410060B5" edc:access="nnnnnnnn" edc:cname="GROUP1PMUX5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410060B6" edc:access="nnnnnnnn" edc:cname="GROUP1PMUX6" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410060B7" edc:access="nnnnnnnn" edc:cname="GROUP1PMUX7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410060B8" edc:access="nnnnnnnn" edc:cname="GROUP1PMUX8" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410060B9" edc:access="nnnnnnnn" edc:cname="GROUP1PMUX9" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410060BA" edc:access="nnnnnnnn" edc:cname="GROUP1PMUX10" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410060BB" edc:access="nnnnnnnn" edc:cname="GROUP1PMUX11" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410060BC" edc:access="nnnnnnnn" edc:cname="GROUP1PMUX12" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
